# RemoveAllMemberForces Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelStick..::..RemoveAllMemberForces Method
AnalyticalModelStick Class See Also
---
Removes all member forces associated with element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool RemoveAllMemberForces()
```

Visual Basic
---
```text
Public Function RemoveAllMemberForces As Boolean
```

Visual C++
---
```text
public:
bool RemoveAllMemberForces()
```

# ### Return Value
True if any member forces were removed, false otherwise.
# See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace